blog/04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Train Has Left The Station</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Train Has Left The Station</h1>
<p>
Well, I've been at it for about two weeks now, and I've certainly got a rythm going.
</p>

<p>
Really, it's going better than I imagined. I've got a BehindRuben video brewing. Just some editing that I will likely finish the next time it's on my calendar. I started the beginning process of my 'Proactive Society' book that I've already started to collect research and sources for. I've started doing the creative writing that I wanted to do; Two stories, one for my substack and another that I think I will self-publish in book marketplaces. I've even been able to keep at my responsibilities on the side.
</p>

<p>
The substack story is an idea I had a while ago, not that novel, but I thought it was an interesting premise. I'm 3000 words in, and I'm kinda hitting a wall in that regard. I think it's to be expected, as I'm coming up to the climax. It just seems so lackluster, like I've misled the reader into thinking something epic was going to happen.
</p>

<p>
This sort of doubt, as I've learned from various videos on the matter of being a creative writter, I think is normal, but it's still a nasty thing to deal with.
</p>

<p>
Other than that, my other biggest challenge is how I'm going to make time for all my other projects. I've completely neglected the efforts at modeling a system over on profileprofiles.com.
</p>

<p>
The setup I have now, is that I dedicate whole days to certain projects, with gaps in between. Like so:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Day 1</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 2</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 3</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 4</td>
<td class="org-left">BehindRuben</td>
</tr>

<tr>
<td class="org-left">Day 5</td>
<td class="org-left">Cooperative Distraction</td>
</tr>

<tr>
<td class="org-left">Day 7</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 8</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 9</td>
<td class="org-left">Narrative Story</td>
</tr>

<tr>
<td class="org-left">Day 10</td>
<td class="org-left">Marketing on the side</td>
</tr>
</tbody>
</table>

<p>
It's for the most part working, and keeping things simple. Simplicity is the king of productivity. As you can see, my creative writing is getting the prioritization I think I should have. Still, it's a shame that it looks like I'm not going to be able to really power through the other projects.
</p>

<p>
I can always be faster, though these days, considering my health, I'm just not able to really do that. I know how I get when I go weeks on end grinding. It leads to burnout and a cynical outlook that I'm not interested in falling into any time soon.
</p>

<p>
In all honesty, I'm on a narrative day, and I'm procrastinating by writing this article, but it looks like I'm almost done, so that excuse is running its course.
</p>

<p>
It's times like these where I look to the ancient knowledge of the <a href="https://en.wikipedia.org/wiki/Bhagavad_Gita">Bahgavad Gita</a>, which emphasized not thinking about the outcome of what you plan to accomplish, but focus on the process of doing so. That hasn't really been a problem till now. I really want to finish this substack story, but maybe if I just keep that in mind, I can get through it.
</p>

<p>
That's all for today.
</p>

<p>
Thanks for reading,
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-23 Fri 14:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
